assignment-two-lruizarce-master/app/controllers/cars_controller.rb

  def new
    @car = Car.new
    @parts = Part.all
    @makes = Make.all
---
SELECT "parts".* FROM "parts"
SELECT "makes".* FROM "makes"

  def create
    @car = Car.new(car_params)
    @makes = Make.all

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("model", "vin", "make_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["model", "Civic"], ["vin", "12223"], ["make_id", 1], ["created_at", "2019-12-02 08:40:16.874239"], ["updated_at", "2019-12-02 08:40:16.874239"]]