assignment-two-lruizarce-master/app/controllers/parts_controller.rb

  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Brakes"], ["created_at", "2019-12-02 08:22:14.964007"], ["updated_at", "2019-12-02 08:22:14.964007"]]