app/views/cars/_form.html.erb

    <%= form.label :make %>
    <%= form.collection_select :make, Make.all, :id, :name %>
---
SELECT "makes".* FROM "makes"

    <%= form.label :part %>
    <%= form.collection_select :part, Part.all, :id, :name %>
---
SELECT "parts".* FROM "parts"